/*
 Localizable.strings
 Owncloud iOs Client
 
 Created by Javier Gonzalez on 7/17/12.
 */

/*
 Copyright (C) 2016, ownCloud GmbH.
 This code is covered by the GNU Public License Version 3.
 For distribution utilizing Apple mechanisms please see https://owncloud.org/contribute/iOS-license-exception/
 You should have received a copy of this license
 along with this program. If not, see <http://www.gnu.org/licenses/gpl-3.0.en.html>.
 */


//First Screen
"go_to_login" = "Nastavenie účtu";
"you_need_an_account" = "Nemáte nastavený žiadny $appname účet na svojom zariadení.\nVytvorte si účet ak chcete používať túto aplikáciu.";

//Login Screen
"testing_connection" = "Prebieha testovanie spojenia";
"server_instance_not_found" = "Server nebol nájdený";
"secure_connection_established" = "Secure Connection";
"https_non_secure_connection_established" = "Presmerované na nezabezpečenú trasu.";
"connection_established" = "Non-secure Connection";
"login_details" = "Podrobnosti prihlásenia";
"username" = "Používateľské meno";
"password" = "Heslo";
"login" = "Pripojiť";
"cancel" = "Zrušiť";
"error_login_message" = "Používateľské meno alebo heslo je nesprávne";
"error_updating_predefined_url" = "Server moved to a different URL. Please, authenticate again to update your account";
"ok" = "OK";
"url_sample" = "Adresa servera https://...";
"forbidden_characters_in_password" = "Toto heslo obsahuje zakázané znaky";
"server" = "Server";
"url" = "URL";
"session_expired" = "Vaše pripojenie vypršalo. Pripojte sa znovu prosím";
"credentials_different_user" = "Zadané prihlasovacie údaje používateľa sa nezhodujú s používateľom tohoto účtu";
"auth_unsupported_auth_method" = "Server nepodporuje túto autentifikačnú metódu";
"server_does_not_give_user_id" = "Váš server nevracia správne používateľské ID. Kontaktujte prosím správcu systému\n	";
"authentification_not_valid" = "Nemôžem verifikovať tento server";
"error_too_many_http_redirects" = "Nastala chyba pri vytváraní spojenia. Skúste to znova.";
"retry" = "Skúsiť znova";
"help_link_login" = "Novinky v $appname?";
"error_could_not_add_account" = "Could not store user information. Please try again.";
"account_not_new" = "Účet pre tohoto používateľa a tento server už v tomto zariadení existuje";
"oauth2_error_access_denied" = "Prístup odmietnutý autorizačným serverom";
"oauth2_error" = "Neúspešná autorizácia";

//TabBarItems
"settings"="Nastavenia";
"files_tab"="Súbory";

//Uploading
"upload" = "Nahrať";
"account" = "Účet:";
"location" = "Miesto:";
"photo_albums" = "Fotoalbumy";
"loading" = "Načítava sa...";
"no_access_to_gallery" = "Povoľte prosím prístup k fotografiám a videám aplikácii $appname. Toto nastavenie možno nájsť v Nastavenia > Osobné > Fotografie.";
"error" = "Chyba";
"upload_failed"="Nahrávanie sa nepodarilo";
"redirection_problem"="Presmerovanie URL nie je podporované";
"all_photos" = "All Photos";

//First View
"menu_upload" = "Nahrať Fotku/Video";
"menu_folder" = "Nový priečinok";
"menu_text_file" = "Nový textový súbor";
"sort_menu_title" = "Zoradiť";
"sort_menu_by_name_option" = "A-Z";
"sort_menu_by_modification_date_option" = "Najnovšie-najstaršie";
"sort_menu_by_kind_option" = "Kind";

//Create/Edit File Text
"create_text_file" = "Vytvoriť nový textový súbor";
"title_view_new_text_file" = "Nový textový súbor";
"title_view_edit_text_file" = "Upraviť textový súbor";
"default_text_file_title" = "Nový textový súbor";
"title_text_file_placeholder" = "Názov...";
"body_text_file_placeholder" = "...";
"error_text_file_exist" = "už existuje";
"error_file_name_empty" = "Názov súbory nesmie byť prázdny.";
"no_changes_made" = "Neboli vykonané žiadne zmeny";
"no_file_downloaded" = "Súbor nie je stiahnutý, nemôžete ho upravovať";


//Create Folder
"create_folder" = "Vytvoriť Nový Priečinok";
"folder_name" = "Zadajte meno priečinka:";
"save" = "Uložiť";
"folder_exist" = "Priečinok s rovnakým názvom už existuje. Zadajte iný názov.";
"folder_create_error"="Priečinok nie je možné vytvoriť";
"not_show_potrait"="Menu v zobrazení na šírku nie je dostupné. Prepnite si zobrazenie na výšku.";
"not_possible_create_folder" = "Priečinok nie je možné vytvoriť";

//FilesView
"confirm_to_delete_item" = "Potvrdiť vymazanie položky";
"yes" = "Áno";
"no" = "Nie";
"delete_from_device" = "Naozaj chcete odstrániť tento súbor zo zariadenia?";
"delete_from_server" = "Naozaj chcete odstrániť tento súbor zo servera?";
"not_possible_connect_to_server" = "Momentálne sa nedá spojiť zo serverom.";
"delete_folder_from_server" = "Naozaj chcete odstrániť tento priečinok zo servera?";
"delete_local_server" = "Vymazať zo zariadenia a servera";
"delete_local" = "Vymazať zo zariadenia";
"delete_server" = "Vymazať zo servera";
"error_path" = "Not found. Please make sure it exists";
"error_not_permission" = "Nemáte oprávnenie na vykonanie tejto operácie";
"folders" = "priečinky";
"files" = "súbor";
"folder" = "priečinok";
"file" = "súbor";
"more_swipe" = "Viac";
"message_not_files" = "Žiadny súbor. Nahrajte niečo!";
"maintenance_mode_on_server_message" = "It is not possible to connect to the server at this time. The server is currently in maintenance mode";

//Refresh file list
"release_refresh"="Pre obnovenie uvoľni...";
"loading_refresh"="Nahráva sa...";
"pull_down_refresh"="Potiahnite dolu pre obnovenie.";

//Miscelanea
"back" = "Späť";

//Preview
"open_with_label" = "Otvoriť v";
"delete_label"= "Zmazať";

//Open with
"file_cannot_be_opened" = "Súbor nemožno otvoriť";
"no_app_instaled_to_open_it" = "Na otvorenie tohoto typu súboru nie je nainštalovaná aplikácia.";

//WTClient messages (Download/Upload)
"establishing_connection" = "Vytváram spojenie";
"not_establishing_connection" = "Nemožno vytvoriť spojenie";
"connection_closed" = "Spojenie je ukončené";
"connection_lost" = "Spojenie je stratené";
"auth_failed" = "Overenie zlyhalo";
"auth_passed" = "Overené";
"request_file_not_found" = "Požadovaný súbor nebol nájdený na serveri";
"request_file_not_accesed" = "Nemožno pristúpiť k požadovanému súboru";
"unknow_response_server" = "Chyba. Neočakávaná odpoveď servera.";
"uploading_data" = "Nahrávam dáta";
"downloading_data" = "Sťahujem dáta";
"transfer_complete" = "Prenos ukončený";
"transfer_failed" = "Prenos zlyhal";
"download_file" = "Download file";

//Settings and PinCode
"title_app_pin" = "Passcode Lock";
"title_app_pin_and_touchID" = "Passcode Lock & Touch ID";
"title_app_pin_and_faceID" = "Passcode Lock & Face ID";
"title_app_pin_forced" = "Change Passcode Lock";
"enter_app_pin" = "Vložiť bezpečnostný kód";
"enter_app_pin_long_description_forced" = "Passcode required. You need to set a passcode to log in.";
"enter_app_pin_long_description" = "Vložiť bezpečnostný kód";
"reenter_app_pin" = "Zopakujte vloženie bezpečnostného kódu";
"remove_app_pin" = "Odstrániť bezpečnostný kód";
"both_pass_not_same" = "Vložené bezpečnostné kódy sa líšia";
"app_pin_incorrect" = "Nesprávny bezpečnostný kód";
"passcode_not_enabled" = "Najskôr povoľte heslo";
"title_app_touchID" = "Touch ID";
"title_app_faceID" = "Face ID";
"disconnect_button" = "Odpojiť od servera";
"pin_removed" = "Bezpečnostný kód odstránený";
"incorrect_pin" = "Nesprávny bezpečnostný kód";
"app_pin_stored" = "Bezpečnostný kód uložený";
"help" = "Pomoc";
"recommend_to_friend" = "Doporučiť známemu";
"send_feedback" = "Odoslať spätnú väzbu";
"manage_accounts" = "Správa účtov";
"add_new_account" = "Pridať nový účet";
"save_changes" = "Uložiť";
"add_account" = "Pridať";
"user_exist" = "Zadaný používateľ už existuje";
"imprint_button" = "Vydavateľ";
"title_instant_upload_photos"="Instant Upload Photos";
"title_instant_upload_videos"="Instant Upload Videos";
"title_background_instant_upload" = "Okamžité nahrávanie na pozadí";
"accounts_section" = "Účty";
"security_section" = "Zabezpečenie";
"instant_updloads_section" = "Okamžité nahratie";
"more_section" = "Viac";
"unlock_app" = "Odomknúť $appname";
"passcode_forced_can_not_be_disabled" = "Passcode forced. Can not be disabled.";
"pending_migration_to_new_url" = "Enter to migrate to new URL";

//Downloading
"can_no_copy_to_gallery" = "Tento súbor nemožno skopírovať do galérie, pretože to nemôže byť galériou otvorený";
"file_is_downloading" = "Tento súbor sa už sťahuje";
"download_file_exist" = "Tento súbor nemožno otvoriť. Skontrolujte, či súbor existuje";
"wait_to_download" = "Príprava sťahovania";
"updating" = "Aktualizujem";
"msg_while_downloads" = "Nie je možné vykonať túto operáciu, prosím počkajte, kým sa skončí aktuálne sťahovanie";
"streaming_no_possible_ssl_self_signed" = "Vysielanie nemohlo byť začaté, pretože Certifikát tvojho servera je nedôveryhodný. Sťahovanie súboru začne automaticky.";

//SSL
"invalid_ssl_cert" = "Nemohla byť overená identita stránky. Chcete dôverovať tomuto certifikátu?";
"connection_declined" = "Spojenie odmietnuté používateľom";
"server_certificate_untrusted" = "Server certificate is not trusted";

//Recent view
"recent_now"="Pred niekoľkými sekundami";
"recent_minutes"="pred $minutes minútami";
"recent_minute"="pred $minutes minútou";
"recent_hours"="pred $hours hodinami";
"recent_hour"="pred $hours hodinou";
"recent_days"="pred $days dňami";
"recent_day"="pred $days dňom";
"recent_months"="pred $months mesiacmi";
"recent_month"="pred $months mesiacom";

"uploads_tab"="Nahranie";
"current_section"="Aktuálne";
"uploader_section"="Odoslané";
"nothing_was_upload_recently"="Z tohoto prístroja nebolo nedávno nič nahrané";
"failed_uploader_section"="Zlyhané nahratia";
"clear_successful"="Čistenie ukončené";
"error_credential"="Chybné prihlasovacie údaje";
"error_destiny_does_not_exist"="Chybný priečinok";
"error_file_exists"="Chyba konfliktu";
"error_permission" = "Chybné oprávnenia.";
"error_not_allowed_by_firewall_rule" = "Nahrávanie nie je povolené";
"error_file_does_not_exist" = "Not available on the device";
"error_file_in_background" = "Chyba servera";
"error_insufficient_storage" = "Nedostatok miesta na disku pre tento Užívateľský profil.";
"error_file_invalid_characters" = "Neplatné znaky";
"change_active_user"="Zmeniť aktívneho používateľa na";
"waiting_for_server"="Čakanie na spojenie so serverom";
"waiting_for_upload"="Čaká sa na nahratie";
"error_permission_alert_message" = "Nemáte oprávnenie sem nahrávať do tohoto priečinka";
"choose_folder" = "Zvoliť priečinok";

//Select Folder View
"upload_label"="Nahrať do";
"create_button"="Vytvoriť";
"choose_button"="Vybrať";

//Rename
"rename_long_press" = "Premenovať";
"rename_file_title" = "Premenovať";
"enter_new_name" = "Zadať nový názov:";
"rename_file_exist" = "Súbor s rovnakým názvom už existuje. Zadajte iný názov.";

//Move
"move_long_press" = "Presunúť";
"move_to_label" = "Presunúť do";
"file_exist" = "Súbor už v cieľovom priečinku existuje";
"override_file" = "Chcete nahradiť existujúci súbor týmto súborom?";
"accept" = "Schváliť";
"error_folder_destiny_is_the_same" = "CHYBA: nie je možné presunúť priečinok do samého seba";
"original_file_exist" = "Nie je možné presunúť tento súbor. Prosím uistite sa že existuje";
"original_folder_exist" = "Nie je možné presunúť tento priečinok. Prosím uistite sa že existuje";

//Download folfer
"download_folder" = "Priečinok na sťahovanie";
"cancel_download" = "Zrušiť sťahovanie";

//Upload from other apps
"other_apps_title" = "Umiestnenie";
"other_apps_account" = "Účet";
"other_apps_folder" = "Priečinok";
"other_apps_file_name" = "Názov súboru";
"other_apps_send_to" = "Nahrať do";
"error_moving_file" = "Súbor nemožno presunúť. Skontrolujte, či cieľový priečinok existuje";
"forbidden_characters_from_server" = "Názov súboru obsahuje aspoň jeden nepovolený znak.";
"overwritte_title" = "Prepísať";

//Social
"twitter_message" = "Skúste $twitteruser na vašom telefóne!";
"facebook_message" = "Skúste $appname na vašom telefóne!\n";
"mail_recommendation_subject" = "Skúste $appname na vašom telefóne!";
"mail_recommendation_body" = "Vyskúšajte si $appname na vašom telefóne!\nNa stiahnutie je tu: ";
"device_not_support_mail" = "Prosím, nastavte si poštový účet";
"mail_feedback_subject" = "Spätná väzba na $appname";
"account_not_configure" = "Toto zariadenie nemá nakonfigurovaný žiadny účet. Prejdite do Nastavenia a nakonfigurujte ho.";

//Storage
"of_storage" = "z";
"occupied_storage" = "obsadené";
"storage" = "Úložisko";
"storage_upgrade" = "Upgrade úložiska";

//Jimmies
"this_file_is_older" = "Nová verzia je k dispozícii";
"msg_update_file_0_bytes" = "Súbor na serveri má 0 bajtov. Chcete prepísať existujúci súbor na vašom zariadení týmto prázdnym súborom?";

//Shared
"shared_tab" = "Verejné Odkazy";
"message_not_shared_files" = "Zatiaľ nie sú k dispozícii žiadne súbory / priečinky zdieľané prostredníctvom odkazu.";
"message_not_shared_api_support" = "Je nám ľúto, zdieľanie na tomto serveri nie je povolené. Prosím, obráťte sa na správcu";
"share_link_long_press" = "Zdieľať";
"unshare_link" = "Zrušiť zdieľanie odkazu";
"share_not_available_on_this_server" = "Je nám ľúto, táto funkcia nie je povolená na serveri. Prosím, obráťte sa na správcu";
"copy_link" = "Kopíruj odkaz";
"file_to_share_not_exist" = "Nie je možné zdieľať tento súbor alebo priečinok. Prosím uistite sa že existuje";
"file_to_unshare_not_exist" = "Nemožno zrušiť zdieľanie tohoto súboru alebo priečinka. Prosím, uistite sa, že existuje";
"shared_link_protected_title" = "Vložte heslo";
"shared_link_protected_message" = "Pre zdieľanie tohoto odkazu musíte zadať heslo, ktorým bude chránený.";
"pasword_empty" = "Heslo nemôže byť prázdne";
"no_pasword" = "Musíte vložiť heslo";
"get_share_link" = "Get Public Link";
"title_share_link_option_name" = "Link Name";
"title_share_link_option_password" = "Heslo";
"title_share_link_option_expiration" = "Koniec platnosti";
"title_share_link_option_allow_dowload_view" = "Stiahnuť/Pozrieť";
"title_share_link_option_allow_dowload_view_upload" = "Stiahnuť/Pozrieť/Nahrať";
"title_share_link_option_allow_upload_only" = "Upload only (File Drop)";
"placeholder_share_link_option_name" = "Názov";
"placeholder_share_link_option_password" = "Choose a password";
"placeholder_share_link_option_expiration" = "Dátum expirácie";
"title_view_create_link" = "Vytvorenie zdieľaného odkazu ";
"title_view_edit_link" = "Editovanie zdieľaného odkazu ";
"title_confirm_delete_link" = "Odstránenie linku";
"message_confirm_delete_link" = "! Delete $sharedLink";
"default_link_name" = "$fileName link";
"allow_editing" = "Povoliť úpravy";
"show_error_password_enforced" = "Password required";
"show_error_expiration_enforced" = "The public link will expire no later than $nDays days after it is created";
"default_not_possible_msg" = "Nie je možné vykonať túto operáciu. Prosím, skúste to neskôr.";
"share_user_group_indicator" = "skupina";
"share_user_federated_indicator" = "vzdialený";
"add_user_or_group_title" = "Pridať používateľa alebo skupinu";
"share_with_users_or_groups" = "Užívatelia a Skupiny";
"not_share_with_users_yet"= "Zatiaľ nesprístupnené iným používateľom";
"not_share_by_link_yet"= "Not shared by public link yet";
"not_sharee_api_supported" = "Je nám ľúto, vaša verzia servera neumožňuje zdieľanie s používateľmi alebo skupinami. Prosím, obráťte sa na svojho správcu";
"share_link_title" = "Public Links";
"warning_sharing_public_link" = "Ktokoľvek s týmto odkazom bude mať prístup na súbor/Adresár";
"not_share_link_enabled_capabilities" = "Je nám ľúto, Zdieľať odkaz nie je na tomto serveri povolené. Prosím, obráťte sa na svojho správcu";
"shared_link_cannot_remove_password" = "Nie je možné odstrániť heslo";
"shared_link_cannot_remove_expiration_date" = "Nemožno vymazať čas vypršania platnosti. Pri zdieľaní je čas vypršania platnosti vyžadovaný.";
"shared_link_mail_subject" = "$userName s vami zdieľa „$fileOrFolderName“";
"secured_link" = "Zabezpečené";
"message_private_link" = "Private link: Only people who have access to the file/folder can use it. Use it as a permanent link for yourself or to point others to files within shares";

//Shared privileges
"title_user_can_edit" = "Môže upraviť";
"title_user_can_share" = "Može sprístupniť";
"user_can_create" = "vytvoriť";
"user_can_change" = "zmeniť";
"user_can_delete" = "vymazať";
"title_view_edit_user_privileges" = "Oprávnenia";

//Shared Link Options
"title_view_share_link_options" = "Link Options";

//Favorites
"favorite" = "Obľúbené";
"unfavorite" = "Odobrať z obľúbených";
"parent_folder_is_favorite" = "Priečinok, ktorý obsahuje tento súbor sa už nachádza medzi obľúbenými";

//Available offline
"available_offline" = "Dostupné offline";
"not_available_offline" = "Nedostupné offline";
"parent_folder_is_available_offline_file_child" = "Priečinok, ktorý obsahuje tento súbor je už dostupný offline";
"parent_folder_is_available_offline_folder_child" = "Priečinok, ktorý obsahuje tento priečinok je už dostupný offline";

//Document provider
"error_login_doc_provider" = "Nepodaril sa prístup k vášmu účtu. Prosím, najskôr použite aplikáciu $appname, aby ste sa prihlásili.";
"error_sending_file_to_document_picker" = "Chyba prenesenia súboru do výberu súborov";
"error_user_change_in_core_app" = "Používateľ bol zmenený v $appname aplikácii";
"error_connecting_with_server" = "Nebolo možné sa pripojiť k serveru, prosím, skúste to neskôr";
"move_doc_provider_button" = "Presunúť do tohoto umiestnenia";
"export_doc_provider_button" = "Exportovať do tohoto umiestnenia";

//Instant uploads
"location_not_enabled"="Služba zisťovania polohy nie je zapnutá";
"message_location_not_enabled"="Prosím, prejdite do Nastavenia a zapnite Lokalizačné služby, aby ste mohli okamžite nahrávať fotografie na pozadí.";

"access_photos_library_not_enabled" = "Prístup k fotografiám nie je zapnutý";
"message_access_photos_not_enabled" = "Prosím, prejdite do Nastavenia a zapnite pre túto aplikáciu Prístup k fotografiám, aby ste mohli okamžite nahrávať fotografie.";

//PDF reader
"page_of_pages" = "z"; //Example: 5 of 10

//Share in
"files_added" = "Súbory pridané";
"files_will_be_upload_next_time" = "Súbory sa začnú nahrávať, keď najbližšie otvoríte $appname";

//Help Guide main app
"title_help_slide_0" = "Víta vás $appname!";
"message_help_slide_0" = "Viac sa dozviete po posunutí";
"title_help_slide_1" = "Okamžité nahratie";
"message_help_slide_1" = "Udržiavajte svoje fotky v bezpečí";
"title_help_slide_2" = "Spravujte všetky svoje súbory";
"message_help_slide_2" = "Nemôžete mazať, presúvať";
"title_help_slide_3" = "Zdieľať";
"message_help_slide_3" = "Môžete zdieľať súbory a priečinky";
"title_help_slide_4" = "MultiÚčet";
"message_help_slide_4" = "Pripojiť ku všetkým vačim cloudom";
"title_help_slide_5" = "Vaše súkromné súbory sú synchronizované, kdekoľvek sa nachádzate";
"message_help_slide_5" = "5";
"sign_in_button_help_guide" = "Prihlásiť sa";
"skip_button_help_guide" = "Preskočiť";

//Update Guide main app
"title_update_slide_0" = "Discover the new ownCloud App";
"message_update_slide_0" = "Rebuilt from scratch for iOS 11+";
"title_update_slide_1" = "PDF Viewer";
"message_update_slide_1" = "Easy Search and Navigation";
"title_update_slide_2" = "File Management";
"message_update_slide_2" = "Share Files and Folders";
"title_update_slide_3" = "Quick Access";
"message_update_slide_3" = "Complete Data Overview";
"title_update_slide_4" = "Multiple Accounts";
"message_update_slide_4" = "Access to all your clouds";
"title_update_slide_5" = "Get it for free on the AppStore";
"message_update_slide_5" = "Secure Data Management";
"sign_in_button_update_guide" = "Sťahovanie";
"skip_button_update_guide" = "Sťahovanie";

//Account menu
"menu_account_edit" = "Edit Password";
"menu_account_clear_cache" = "Vyčistiť medzipamäť";
"menu_account_log_out" = "Odstrániť účet";

//Common
"not_connected_to_internet" = "Zariadenie nie je pripojené do siete.";
"bad_request" = "Bad request";
"method_not_allowed" = "Method not allowed";
"proxy_auth_required" = "Proxy authorization required";
"conflict" = "Konflikt";
"internal_error" = "Internal server error";
"not_implemented" = "Neimplementované";
"bad_gateway" = "Bad gateway";

//Private links
"private_link_redirection_failed" = "The item does not exist";
"error_connecting_with_server" = "Nebolo možné sa pripojiť k serveru, prosím, skúste to neskôr";
"private_link_not_reachable" = " Private link could not be opened";
